Repository: capstanlqc-mtpe/CIDQ_BillingCode2026_fr-CA_omt
Catalog: omegat/project_save.tmx
Source language: en
Languages: fr_ca

source: Carbon monoxide alarms shall be provided in accordance with Sections R315.2.1 and R315.2.2.
fr_ca: Des détecteurs de monoxyde de carbone doivent être prévus selon les sections R315.2.1 et R315.2.2.

source: Carbon monoxide alarms shall comply with Section R315.
fr_ca: Les détecteurs de monoxyde de carbone doivent être conformes à la section R315.

source: Carbon monoxide alarms shall comply with Sections 915.4.1 through 915.4.4.
fr_ca: Les alarmes de monoxyde de carbone doivent être conformes aux sections 915.4.1 à 915.4.4.

source: Carbon monoxide alarms shall only be installed in dwelling units and in sleeping units.
fr_ca: Les alarmes de monoxyde de carbone doivent être installés seulement dans les logements et dans les unités de couchage.

source: Carbon monoxide alarms shall receive their primary power from the building wiring where such wiring is served from a commercial source and, where primary power is interrupted, shall receive power from a battery.
fr_ca: Les détecteurs de monoxyde de carbone doivent être alimentés en électricité primaire par le câblage du bâtiment lorsque ce câblage est alimenté par une source commerciale et, en cas d'interruption de l'alimentation primaire, ils doivent être alimentés par une batterie.

source: Carbon monoxide alarms shall receive their primary power from the building wiring where such wiring is served from a commercial source, and when primary power is interrupted, shall receive power from a battery.
fr_ca: Les alarmes de monoxyde de carbone doivent recevoir leur alimentation électrique principale du câblage du bâtiment lorsque celui-ci est alimenté par une source commerciale et, lorsque l’alimentation principale est interrompue, elles doivent être alimentées par une pile.

source: Carbon monoxide detection required by Sections 915.1 through 915.2.3 shall be provided by carbon monoxide alarms complying with Section 915.4 or carbon monoxide detection systems complying with Section 915.5.
fr_ca: La détection de monoxyde de carbone exigée par les sections 915.1 à 915.2.3 doit être assurée au moyen de détecteurs de monoxyde de carbone conformes à la section 915.4 ou de systèmes de détection de monoxyde de carbone conformes à la section 915.5.

source: Carbon monoxide detection shall be allowed to be installed outside of each separate sleeping area in the immediate vicinity of the sleeping unit where the sleeping unit or its attached bathroom does not contain a fuel-burning appliance and is not served by a forced air furnace.
fr_ca: La détection de monoxyde de carbone peut être installée à l’extérieur de chaque aire de couchage distincte, à proximité immédiate de l’unité de couchage, lorsque l’unité de couchage ou sa salle de bains attenante ne contient pas d’appareil à combustion et n’est pas desservie par un appareil de chauffage à air pulsé.

source: Carbon monoxide detection shall be installed in dwelling units outside of each separate sleeping area in the immediate vicinity of the bedrooms.
fr_ca: La détection de monoxyde de carbone doit être installée dans les logements, à l’extérieur de chaque aire de couchage distincte, à proximité immédiate des chambres.

source: Carbon monoxide detection shall be installed in existing buildings in accordance with Chapter 11 of the International Fire Code.
fr_ca: La détection de monoxyde de carbone doit être installée dans les bâtiments existants conformément au chapitre 11 de l'International Fire Code.

source: Carbon monoxide detection shall be installed in sleeping units.
fr_ca: Un dispositif de détection de monoxyde de carbone doit être installé dans les unités de couchage.

source: Carbon monoxide detection shall be provided in Group I-1, I-2, I-4 and R occupancies and in classrooms in Group E occupancies in the locations specified in Section 915.2 where any of the conditions in Sections 915.1.2 through 915.1.6 exist.
fr_ca: La détection de monoxyde de carbone doit être prévue dans les usages des groupes I-1, I-2, I-4 et R ainsi que dans les salles de classe des usages du groupe E, aux endroits précisés à la section 915.2, lorsque l’une des conditions énoncées aux sections 915.1.2 à 915.1.6 est présente.

source: Carbon monoxide detection shall be provided in dwelling units, sleeping units and classrooms in buildings with attached private garages.
fr_ca: La détection du monoxyde de carbone doit être prévue dans les logements, les unités de couchage et les salles de classe dans les bâtiments avec garages privés attenants.

source: Carbon monoxide detection shall be provided in dwelling units, sleeping units and classrooms located in buildings that contain fuel-burning appliances or fuel-burning fireplaces.
fr_ca: La détection de monoxyde de carbone doit être prévue dans les logements, les unités de couchage et les salles de classe situés dans des bâtiments qui contiennent des appareils à combustion ou des foyers à combustion.

source: Carbon monoxide detection shall be provided in dwelling units, sleeping units and classrooms served by a fuel-burning, forced-air furnace.
fr_ca: La détection de monoxyde de carbone doit être prévue dans les logements, les unités de couchage et les salles de classe desservis par un appareil de chauffage à air pulsé à combustion.

source: Carbon monoxide detection shall be provided in dwelling units, sleeping units and classrooms that contain a fuel-burning appliance or a fuel-burning fireplace.
fr_ca: La détection de monoxyde de carbone doit être prévue dans les logements, les unités de couchage et les salles de classe qui contiennent un appareil à combustion ou un foyer à combustion.

source: Carbon monoxide detection shall not be required in dwelling units, sleeping units and classrooms if a carbon monoxide detector is provided in the first room or area served by each main duct leaving the furnace, and the carbon monoxide alarm signals are automatically transmitted to an approved location.
fr_ca: La détection de monoxyde de carbone n’est pas requise dans les logements, les unités de couchage et les salles de classe lorsqu’un détecteur de monoxyde de carbone est installé dans la première pièce ou aire desservie par chaque gaine principale sortant de l’appareil de chauffage et que les signaux d’alarme du détecteur de monoxyde de carbone sont automatiquement transmis à un endroit approuvé.

source: Carbon monoxide detection systems shall be an acceptable alternative to carbon monoxide alarms and shall comply with Sections 915.5.1 through 915.5.3.
fr_ca: Les systèmes de détection de monoxyde de carbone doivent être une solution de rechange acceptable aux alarmes de monoxyde de carbone et doivent être conformes aux sections 915.5.1 à 915.5.3.

source: Carbon monoxide detection systems shall be permitted to be used in lieu of carbon monoxide alarms and shall comply with Sections R315.7.1 through R315.7.4.
fr_ca: Les systèmes de détection de monoxyde de carbone peuvent être utilisés à la place des détecteurs de monoxyde de carbone et doivent être conformes aux sections R315.7.1 à R315.7.4.

source: Carbon monoxide detection systems shall comply with NFPA 720.
fr_ca: Les systèmes de détection de monoxyde de carbone doivent être conformes à la norme NFPA 720.

source: Carbon monoxide detectors shall be installed in classrooms in Group E occupancies.
fr_ca: Des détecteurs de monoxyde de carbone doivent être installés dans les salles de classe des usages du groupe E.

source: Carbon monoxide detectors shall be installed in the locations specified in Section 915.2.
fr_ca: Les détecteurs de monoxyde de carbone doivent être installés aux endroits spécifiés à la section 915.2.

source: Carbon monoxide detectors shall be installed in the locations specified in Section R315.3.
fr_ca: Les détecteurs de monoxyde de carbone doivent être installés aux endroits spécifiés à la section R315.3.

source: Carbon monoxide detectors shall be listed in accordance with UL 2075.
fr_ca: Les détecteurs de monoxyde de carbone doivent être répertoriés conformément à la norme UL 2075.

source: Care facilities for five or fewer persons receiving care that are within a single-family dwelling are permitted to comply with the International Residential Code provided an automatic sprinkler system is installed in accordance with Section 903.3.1.3 or Section P2904 of the International Residential Code.
fr_ca: Les établissements de soins destinés à cinq personnes ou moins qui reçoivent des soins et qui sont situés dans une habitation unifamiliale peuvent être conformes à l’International Residential Code, à condition qu’un système de gicleurs automatiques soit installé conformément à l’article 903.3.1.3 ou à l’article P2904 de l’International Residential Code.

source: Care facilities that provide accommodations for five or fewer persons receiving care
fr_ca: Établissements de soins offrant un hébergement à cinq personnes ou moins qui reçoivent des soins

source: Carpet edge trim shall comply with Section 303.
fr_ca: La bordure du tapis doit être conforme à la section 303.

source: Carpet or carpet tile shall be securely attached and shall have a firm cushion, pad, or backing or no cushion or pad.
fr_ca: Le tapis ou la dalle de moquette doit être solidement fixé et doit avoir un coussin, un rembourrage ou un support ferme, ou ne pas avoir de coussin ou de rembourrage.

source: Carpet or carpet tile shall have a level loop, textured loop, level cut pile, or level cut/uncut pile texture.
fr_ca: Le tapis ou la dalle de moquette doit avoir une boucle plate, une boucle texturée, un poil coupé plat ou une texture de poil coupé plat/non coupé.

source: Carpet-type floor coverings shall be tested as proposed for use, including underlayment.
fr_ca: Les revêtements de sol de type tapis doivent être soumis à des essais dans les conditions prévues pour leur utilisation, y compris avec la sous-couche.

source: Catwalks.
fr_ca: Passerelles.

source: Cells or rooms specially designed without protrusions and that are used solely for purposes of suicide prevention shall not be required to include grab bars.
fr_ca: Les cellules ou les pièces conçues expressément sans éléments en saillie et qui sont utilisées uniquement à des fins de prévention du suicide ne sont pas tenues d'être munies de barres d'appui.

source: Cells or rooms subject to this requirement include, but are not limited to, those used for purposes of orientation, protective custody, administrative or disciplinary detention or segregation, detoxification and medical isolation.
fr_ca: Les cellules ou les pièces visées par cette exigence comprennent notamment celles utilisées à des fins d’orientation, de garde préventive, de détention ou d’isolement administratif ou disciplinaire, de désintoxication et d’isolement médical.

source: Certificates presuming to give authority to violate or cancel the provisions of this code or other ordinances of the jurisdiction shall not be valid.
fr_ca: Les certificats qui prétendent autoriser une violation des dispositions du présent code ou d’autres règlements de la compétence territoriale, ou en annuler l’application, ne sont pas valides.

source: Changes in level are not permitted.
fr_ca: Les changements de niveau ne sont pas autorisés.

source: Changes in level shall comply with Section 303.
fr_ca: Les changements de niveau doivent être conformes à la section 303.

source: Character spacing shall be measured between the two closest points of adjacent raised characters within a message, excluding word spaces.
fr_ca: L'espacement des caractères doit être mesuré entre les deux points les plus proches de caractères en relief adjacents dans un message, à l'exclusion des espaces entre les mots.

source: Characters and their background shall have a non-glare finish.
fr_ca: Les caractères et leur arrière-plan doivent avoir une finition antireflet.

source: Characters or braille shall not be located in the pictogram field.
fr_ca: Les caractères ou le braille ne doivent pas être situés dans le champ du pictogramme.

source: Characters shall be conventional in form.
fr_ca: Les caractères doivent être de forme conventionnelle.

source: Characters shall be separated from raised borders and decorative elements 3/8 inch (9.5 mm) minimum.
fr_ca: Les caractères doivent être séparés des bordures en relief et des éléments décoratifs d'au moins 3/8 po [9,5 mm].

source: Characters shall be uppercase, lowercase, or a combination of both.
fr_ca: Les caractères doivent être en majuscules, en minuscules ou une combinaison des deux.

source: Characters shall contrast with their background with either light characters on a dark background, or dark characters on a light background.
fr_ca: Les caractères doivent contraster avec leur arrière-plan, soit avec des caractères clairs sur un fond foncé, soit avec des caractères foncés sur un fond clair.

source: Characters shall contrast with their background, with either light characters on a dark background or dark characters on a light background.
fr_ca: Les caractères doivent contraster avec leur arrière-plan, soit des caractères clairs sur un arrière-plan foncé, soit des caractères foncés sur un arrière-plan clair.

source: Characters shall contrast with their background, with either light characters on a dark background, or dark characters on a light background.
fr_ca: Les caractères doivent contraster avec leur arrière-plan, soit avec des caractères clairs sur un fond sombre, soit avec des caractères foncés sur un fond clair.

source: Characters shall not be italic, oblique, script, highly decorative, or of other unusual forms.
fr_ca: Les caractères ne doivent pas être en italique, obliques, cursifs, très décoratifs ou d'autres formes inhabituelles.

source: Chimney walls with flue lining
fr_ca: Murs de cheminée avec revêtement de conduit

source: ChimneyVertical reinforcingb
fr_ca: Cheminée Renforcement vertical b

source: Chutes shall have additional sprinkler heads installed at alternate floors and at the lowest intake.
fr_ca: Des têtes d’extincteurs automatiques supplémentaires doivent être installées dans les vide-ordures et les vide-linge à chaque étage sur deux et au niveau de la prise la plus basse.

source: Circulating air ducts used with steel fireplace units shall be constructed of metal or masonry.
fr_ca: Les conduits de circulation d'air utilisés avec les foyers en acier doivent être construits en métal ou en maçonnerie.

source: Circulation paths shall comply with Section 1105.5.
fr_ca: Les voies de circulation doivent être conformes à la section 1105.5.

source: Classroom ambient sound levels shall comply with Sections 808.3.1 and 808.3.2.
fr_ca: Les niveaux sonores ambiants dans les salles de classe doivent être conformes aux sections 808.3.1 et 808.3.2.

source: Classroom ambient sound levels shall not exceed 35 dBA and 55 dBC due to intruding noise from sound sources outside of the classroom, whether from the exterior or from other interior spaces.
fr_ca: Les niveaux sonores ambiants dans la salle de classe ne doivent pas dépasser 35 dBA et 55 dBC en raison du bruit intrusif provenant de sources sonores à l'extérieur de la salle de classe, que ce soit de l'extérieur ou d'autres espaces intérieurs.

source: Classroom ambient sound levels shall not exceed 35 dBA and 55 dBC for noise from sound sources inside the classroom.
fr_ca: Les niveaux sonores ambiants dans la salle de classe ne doivent pas dépasser 35 dBA et 55 dBC pour le bruit provenant de sources sonores à l'intérieur de la salle de classe.

source: Classroom equipment, including, but not limited to, computers, printers and fish tank pumps shall be turned off during these measurements.
fr_ca: L'équipement de la salle de classe, y compris, mais sans s'y limiter, les ordinateurs, les imprimantes et les pompes d'aquarium, doit être éteint pendant ces mesures.

source: Classroom reverberation times shall comply with either Section 808.2.1 or Section 808.2.2, depending on the size of the room.
fr_ca: Les temps de réverbération des salles de classe doivent être conformes à l'article 808.2.1 ou à l'article 808.2.2, selon la taille de la pièce.

source: Classrooms not exceeding 20,000 cubic feet (565 m3) and required to provide enhanced acoustics shall comply with Section 808.
fr_ca: Les salles de classe n'excédant pas 20 000 pieds cubes (565 m3) et devant offrir une acoustique améliorée doivent être conformes à la section 808.

source: Cleanout openings located within foundation walls below fireboxes, where provided, shall be equipped with ferrous metal or masonry doors and frames constructed to remain tightly closed except when in use.
fr_ca: Les ouvertures de nettoyage situées dans les murs de fondation sous les foyers, lorsqu'elles sont prévues, doivent être équipées de portes et de cadres en métal ferreux ou en maçonnerie construits de manière à rester hermétiquement fermés, sauf lorsqu'ils sont utilisés.

source: Cleanouts shall be located to allow access so that ash removal will not create a hazard to combustible materials.
fr_ca: Les ouvertures de nettoyage doivent être situées de manière à permettre l'accès, afin que l'enlèvement des cendres ne crée pas de danger pour les matériaux combustibles.

source: Clear floor space at fixtures shall be permitted to include knee and toe clearances complying with Section 306.
fr_ca: La surface de plancher dégagée au niveau des appareils sanitaires peut inclure les espaces pour les genoux et les orteils conformément à la section 306.

source: Clear floor spaces at appliances shall comply with Sections 1104.12.2 and 1104.1.1.
fr_ca: Les surfaces de plancher dégagées au niveau des appareils doivent être conformes aux sections 1104.12.2 et 1104.1.1.

source: Clear floor spaces required by Section 1104.11.3.1 (Option A) or 1104.11.3.2 (Option B) shall comply with Sections 1104.11.2 and 1104.1.1.
fr_ca: Les surfaces de plancher dégagées exigées par la section 1104.11.3.1 (Option A) ou 1104.11.3.2 (Option B) doivent être conformes aux sections 1104.11.2 et 1104.1.1.

source: Clear floor spaces required by Sections 1103.12.3 through 1103.12.5 shall comply with Section 305.
fr_ca: Les surfaces de plancher dégagées exigées par les sections 1103.12.3 à 1103.12.5 doivent être conformes à la section 305.

source: Clear opening of swinging doors shall be measured between the face of the door and stop, with the door open 90 degrees.
fr_ca: L'ouverture libre des portes à charnières doit être mesurée entre la face de la porte et la butée, lorsque la porte est ouverte à 90 degrés.

source: Clear width of landings shall be at least as wide as the widest ramp run leading to the landing.
fr_ca: La largeur libre des paliers doit être au moins aussi large que la course de rampe la plus large menant au palier.

source: Clearance around the water closet shall be 48 inches (1220 mm) minimum in width, measured perpendicular from the side of the clearance that is 16 inches (405 mm) minimum and 18 inches (455 mm) maximum from the water closet centerline.
fr_ca: Le dégagement autour de la cabine de toilette doit avoir une largeur minimale de 48 po [1220 mm], mesurée perpendiculairement au côté du dégagement qui se trouve à une distance comprise entre 16 po [405 mm] et 18 po [455 mm] de la ligne d'axe de la cabine de toilette.

source: Clearance around the water closet shall be 56 inches (1420 mm) minimum in depth, measured perpendicular from the rear wall.
fr_ca: Le dégagement autour d’une toilette doit avoir une profondeur minimale de 56 po [1420 mm], mesurée perpendiculairement au mur arrière.

source: Clearance around the water closet shall be 60 inches (1525 mm) minimum in width, measured perpendicular from the side wall.
fr_ca: Le dégagement autour de la cabine de toilette doit avoir une largeur minimale de 60 po (1525 mm), mesurée perpendiculairement à la paroi latérale.

source: Clearance around the water closet shall comply with Sections 1104.11.3.1.2.2.1 through 104.11.3.1.2.2.3.
fr_ca: Le dégagement autour de la cabine de toilette doit être conforme aux sections 1104.11.3.1.2.2.1 à 104.11.3.1.2.2.3.

source: Clearance between all opposing base cabinets, countertops, appliances, or walls within kitchen work areas shall be 40 inches (1015 mm) minimum.
fr_ca: Le dégagement entre toutes les armoires de base de mur opposées, les comptoirs, les appareils électroménagers ou les murs dans les zones de travail de la cuisine doit être d'au moins 40 po [1015 mm].

source: Clearance between handrail gripping surface and adjacent surfaces shall be 11/2 inches (38 mm) minimum.
fr_ca: L'espacement entre la surface de préhension de la rampe et les surfaces adjacentes doit être d'au moins 11/2 po (38 mm).

source: Clearance complying with Section 1103.12.1 shall be provided.
fr_ca: Un dégagement conforme à la section 1103.12.1 doit être prévu.

source: Clearance complying with Section 1104.12.1 shall be provided.
fr_ca: Un dégagement conforme à la section 1104.12.1 doit être prévu.

source: Clearance complying with Sections 1103.11.2.4.2 through 1103.11.2.4.4.
fr_ca: Dégagement conforme aux articles 1103.11.2.4.2 à 1103.11.2.4.4.

source: Clearances
fr_ca: Dégagements

source: Clearances at the water closet shall comply with Section 1104.11.3.1.2.
fr_ca: Les dégagements autour du cabinet d’aisances doivent être conformes à la section 1104.11.3.1.2.

source: Clearances between all opposing base cabinets, counter tops, appliances or walls within the food preparation area shall be 40 inches (1015 mm) minimum.
fr_ca: Les dégagements entre toutes les armoires de base, tous les comptoirs, tous les appareils électroménagers ou tous les murs opposés dans la zone de préparation des aliments doivent être d’au moins 40 po [1015 mm].

source: Coat hooks provided within the room shall accommodate a forward reach or side reach complying with Section 308.
fr_ca: Les crochets à vêtements prévus dans la pièce doivent permettre une portée vers l'avant ou une portée latérale conforme à la Section 308.

source: Combination carbon monoxide and smoke alarms shall be listed in accordance with UL 2034 and UL 217.
fr_ca: Les détecteurs combinés de monoxyde de carbone et de fumée doivent être répertoriés conformément aux normes UL 2034 et UL 217.

source: Combination carbon monoxide and smoke alarms shall be permitted to be used in lieu of carbon monoxide alarms.
fr_ca: Les détecteurs combinés de monoxyde de carbone et de fumée peuvent être utilisés à la place des détecteurs de monoxyde de carbone.

source: Combination carbon monoxide and smoke detectors installed in carbon monoxide detection systems in lieu of carbon monoxide detectors shall be listed in accordance with UL 2075 and UL 268.
fr_ca: Les détecteurs combinés de monoxyde de carbone et de fumée installés dans les systèmes de détection de monoxyde de carbone au lieu des détecteurs de monoxyde de carbone doivent être inscrits conformément aux normes UL 2075 et UL 268.

source: Combination carbon monoxide/smoke alarms shall be an acceptable alternative to carbon monoxide alarms.
fr_ca: Les alarmes combinées de monoxyde de carbone et de fumée constituent une solution de remplacement acceptable aux alarmes de monoxyde de carbone.

source: Combination carbon monoxide/smoke alarms shall be listed in accordance with UL 217 and UL 2034.
fr_ca: Les alarmes combinées de monoxyde de carbone et de fumée doivent être homologuées conformément aux normes UL 217 et UL 2034.
